ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/OTTOCAL_OTTOCAL_502E0000h.xml
<module name="OTTOCAL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="OTTOCAL_HRPWR" acronym="OTTOCAL_HRPWR" offset="66" width="16" description="HRPWM Power Register  This register is only accessible on EPWM modules with HRPWM capabilities.">
		<bitfield id="CALPWRON" width="1" begin="15" end="15" resetval="0x0" description="MEP Calibration Power Bits [only available on ePWM1]  0:Disables MEP calibration logic in the HRPWM and reduces power consumption.  1:Enables MEP calibration logic" range="15" rwaccess="R/W"/>
	<bitfield id="CALSEL" width="4" begin="9" end="6" resetval="0x0" description="EPWM Delay Line Selection for Calibration:" range="9:6" rwaccess="R/W"/>
	<bitfield id="TESTSEL" width="1" begin="5" end="5" resetval="0x0" description="Test Mode Select Bit: This bit selects if a dummy delay is added in Oscillator Calibration mode to help reducing frequency when small delays are used:" range="5" rwaccess="R/W"/>
	<bitfield id="CALSTS" width="1" begin="4" end="4" resetval="0x0" description="Calibration Status Bit: This bit, when set to 1, indicates that calibration is in progress. It is set to 0 when:" range="4" rwaccess="R"/>
	<bitfield id="CNTSEL" width="1" begin="3" end="3" resetval="0x0" description="Counter Select Bit: Functionality of this bit has changed. When HRCNT0 or HRCNT1 reaches 0xFFFF, both counters are frozen. This bit will have an effect on when calibration starts: " range="3" rwaccess="R/W"/>
	<bitfield id="CALSTART" width="1" begin="2" end="2" resetval="0x0" description="Calibration Start/Stop Bit:" range="2" rwaccess="R/W"/>
	<bitfield id="CALMODE" width="2" begin="1" end="0" resetval="0x0" description="Note: CALMODE bits in HRPWM Module. Not used here." range="1:0" rwaccess="R/W"/>
	</register><register id="OTTOCAL_HRMSTEP" acronym="OTTOCAL_HRMSTEP" offset="76" width="16" description="HRPWM MEP Step Register  This register is only accessible on EPWM modules with HRPWM capabilities. Only 16 bit accesses are allowed for this register.  Debugger access in 32 bit mode may display incorrect values.">
		<bitfield id="HRMSTEP" width="8" begin="7" end="0" resetval="0x0" description="High Resolution MEP Step  When auto-conversion is enabled [HRCNFG[AUTOCONV] = 1], This 8-bit field contains the MEP_ScaleFactor [number of MEP steps per coarse steps] used by the hardware to automatically convert the value in the CMPAHR, CMPBHR, DBFEDHR, DBREDHR , TBPHSHR, or TBPRDHR register to a scaled micro-edge delay on the high-resolution ePWM output. The value in this register is written by the SFO calibration software at the end of each calibration run." range="7:0" rwaccess="R/W"/>
	</register>
</module>